# q-sql & tables

* Generally q-sql follows sql syntax of
    * "Select.. from.. where.."
    
    
* dataTbl:("DSSJ"; enlist ",") 0:dataList;
    * im not sure what this function does explicitly and couldnt find reference to this
    
    
* 98h references table type

In [1]:
dataList,:(
   "date,sym,order type,orderQty"
  ;"2020.03.09,AAPL.OQ,MID QUOTE,80000"
  ;"2020.03.09,AAPL.OQ,FAR TOUCH,50000"
  ;"2020.03.09,AAPL.OQ,NEAR TOUCH,120000"
  ;"2020.03.10,AAPL.OQ,MID QUOTE,100000"
  ;"2020.03.10,AAPL.OQ,FAR TOUCH,70000"
  ;"2020.03.10,AAPL.OQ,NEAR TOUCH,170000"
  ;"2020.03.09,IBM.N,MID QUOTE,83000"
  ;"2020.03.09,IBM.N,FAR TOUCH,54000"
  ;"2020.03.09,IBM.N,NEAR TOUCH,129000"
  ;"2020.03.10,IBM.N,MID QUOTE,130000"
  ;"2020.03.10,IBM.N,FAR TOUCH,79000"
  ;"2020.03.10,IBM.N,NEAR TOUCH,175000"
  ;"2020.03.09,BABA.N,MID QUOTE,120000"
  ;"2020.03.09,BABA.N,FAR TOUCH,68000"
  ;"2020.03.09,BABA.N,NEAR TOUCH,930000"
  ;"2020.03.10,BABA.N,MID QUOTE,150000"
  ;"2020.03.10,BABA.N,FAR TOUCH,96000"
  ;"2020.03.10,BABA.N,NEAR TOUCH,2030000"
 );

In [2]:
dataTbl:("DSSJ"; enlist ",") 0:dataList;
show dataTbl
type(dataTbl)

date       sym     order type orderQty
--------------------------------------
2020.03.09 AAPL.OQ MID QUOTE  80000
2020.03.09 AAPL.OQ FAR TOUCH  50000
2020.03.09 AAPL.OQ NEAR TOUCH 120000
2020.03.10 AAPL.OQ MID QUOTE  100000
2020.03.10 AAPL.OQ FAR TOUCH  70000
2020.03.10 AAPL.OQ NEAR TOUCH 170000
2020.03.09 IBM.N   MID QUOTE  83000
2020.03.09 IBM.N   FAR TOUCH  54000
2020.03.09 IBM.N   NEAR TOUCH 129000
2020.03.10 IBM.N   MID QUOTE  130000
2020.03.10 IBM.N   FAR TOUCH  79000
2020.03.10 IBM.N   NEAR TOUCH 175000
2020.03.09 BABA.N  MID QUOTE  120000
2020.03.09 BABA.N  FAR TOUCH  68000
2020.03.09 BABA.N  NEAR TOUCH 930000
2020.03.10 BABA.N  MID QUOTE  150000
2020.03.10 BABA.N  FAR TOUCH  96000
2020.03.10 BABA.N  NEAR TOUCH 2030000

98h

## Removing spaces from column names
https://stackoverflow.com/questions/21895949/kdb-q-column-name-with-spaces/21939410

" The issue is that standard select queries can't deal with the column names having spaces. 
You could use a functional select but the easiest thing to do is rename the column names of the table using the keyword xcol. "

In [8]:
dataTbl:xcol[`$ssr[;" ";""]each string cols dataTbl;dataTbl]
show dataTbl

date       sym     ordertype  orderQty
--------------------------------------
2020.03.09 AAPL.OQ MID QUOTE  80000
2020.03.09 AAPL.OQ FAR TOUCH  50000
2020.03.09 AAPL.OQ NEAR TOUCH 120000
2020.03.10 AAPL.OQ MID QUOTE  100000
2020.03.10 AAPL.OQ FAR TOUCH  70000
2020.03.10 AAPL.OQ NEAR TOUCH 170000
2020.03.09 IBM.N   MID QUOTE  83000
2020.03.09 IBM.N   FAR TOUCH  54000
2020.03.09 IBM.N   NEAR TOUCH 129000
2020.03.10 IBM.N   MID QUOTE  130000
2020.03.10 IBM.N   FAR TOUCH  79000
2020.03.10 IBM.N   NEAR TOUCH 175000
2020.03.09 BABA.N  MID QUOTE  120000
2020.03.09 BABA.N  FAR TOUCH  68000
2020.03.09 BABA.N  NEAR TOUCH 930000
2020.03.10 BABA.N  MID QUOTE  150000
2020.03.10 BABA.N  FAR TOUCH  96000
2020.03.10 BABA.N  NEAR TOUCH 2030000

In [9]:
select sum orderQty by ordertype from dataTbl

ordertype | orderQty
----------| --------
FAR TOUCH | 417000
MID QUOTE | 663000
NEAR TOUCH| 3554000

In [13]:
select sum orderQty by sym from dataTbl where ordertype like "MID QUOTE"

sym    | orderQty
-------| --------
AAPL.OQ| 180000
BABA.N | 270000
IBM.N  | 213000